content/information-science/2022-27ba711f-28e9-35b4-5c13-5fb121b8023d.md
+++
title = "Surface Laptop 1にUbuntuを(LUKSによる暗号化つきで)インストールする"
author = ["ROCKTAKEY"]
date = 2022-01-31T02:50:00+09:00
lastmod = 2022-01-31T02:58:30+09:00
draft = false
+++

基本的には[参考](#surface-linux-reference)にあるサイトに準拠しています。


## 必要なもの {#必要なもの}

-   USBハブ (USB端子が1つしかないため、以下の2つを同時に接続するために必要)
-   USBキーボード (途中までSurfaceにもとからついているキーボードは使えません)
-   USBメモリ (Ubuntuのブート用)


## ブート用のUbuntuをUSBメモリに用意する {#ブート用のubuntuをusbメモリに用意する}

基本[ここ](https://zenn.dev/sprout2000/articles/52caaffa9ad3fa#1.-usb-%E3%82%A4%E3%83%B3%E3%82%B9%E3%83%88%E3%83%BC%E3%83%AB%E3%83%87%E3%82%A3%E3%82%B9%E3%82%AF%E3%81%AE%E4%BD%9C%E6%88%90)のとおりにやればよい。あらかじめ作っておいてある人もいそう。ここ以外にもたくさん文献があると思うので
ここでは説明しない。


## UEFIでセキュアブートを無効にする {#uefiでセキュアブートを無効にする}

音量アップボタン(F6)を押しつづけながら、電源を入れる。
もしくは、Windowsを立ち上げて「設定&gt;更新とセキュリティ&gt;PCの起動をカスタマイズする&gt;今すぐ再起動&gt;
トラブルシューティング&gt;詳細オプション&gt;UEFIファームウェアの設定」と行く。UEFIは、BIOSの進化版みたいな
ものらしい。

UEFIに入ったら、「Security&gt;Secure Boot&gt;Change configuration」をクリックして、「Microsoft only」から
「None」に変更する。LUKSで暗号化すればどうせSSDの中身はパスワードなくして読めないので、
セキュアブートはなくても問題ない気がしている(本当か？)。
後でLUKSのパスワードを求められたときには堅牢なパスワードにしておきましょう。

最後に、Boot configurationタブで、USB Storageを一番上にもっていく。これで、Windowsではなく
USBにあるUbuntuが先に立ち上がるようになる。


## Ubuntuを起動する {#ubuntuを起動する}

まず、SurfaceにUbuntuの入ったUSBとキーボードを、USBハブ経由で繋ぐ。
そして、「exit&gt;Restart now」すると、Ubuntuが立ち上がる。


## Ubuntuをインストール {#ubuntuをインストール}

基本は下記のURLに従ってもらえればいいが、暗号化するのに注意がある。
「インストールの種類」のタイミングで、「ディスクを削除してUbuntuをインストール」すると思うが、
ここで「高度な機能」をクリックし、「新しいUbuntu」の「インストールにLVMを使用する」を選択し、
「安全のために新しいUbuntuのインストールを暗号化する」にチェックを入れて欲しい。
これで、bitlockerと同様にディスクが暗号化される。

URLは[これ](https://linuxfan.info/ubuntu-20-04-install-guide)。「ストレージ設定」の見出しのところに
その画面がある。この記事では暗号化をしていないので、一切触れられていない。
この後パスワードを入力させられる(パスワードなしでもいけるが、セキュアブートなしだと危うそう)。
そのとき、バックアップキーが表示されるので、パスワードを忘れたときのためにどこかにメモっておく。


## Surface用のカーネルを導入 {#surface用のカーネルを導入}

次に、Surfaceの各種デバイスが使えるよう、専用のカーネルをインストールする。
基本は[ここ](https://github.com/linux-surface/linux-surface/wiki/Installation-and-Setup#debian--ubuntu)に買いてある通りでよい。ただし、

```shell { linenos=table, linenostart=1 }
sudo apt install linux-surface-secureboot-mok
sudo update-grub
```

に関しては、セキュアブートしないのならば必要ない。
私はこれを実行した上で、UEFIにおいてセキュアブートを「Microsoft and 3rd party CA」としても
セキュアブートできなかったので断念した。余力があればチャレンジしてほしい。


## キーボードをLUKSパスワード入力時にも使えるようにする {#キーボードをluksパスワード入力時にも使えるようにする}

このまま再起動すると、起動時にLUKSのパスワードを聞かれる。
しかし、その時点で読み込まれるファイルシステムはSurfaceのキーボードのドライバを含んでいないらしく、
外部キーボードでしか入力できない。これでは使いものにならないので、最初に読まれるモジュールを追加する。

エディタは問わないが、 `/etc/initramfs-tools/modules` を開いて、以下を末尾に追加する。
root権限が必要なので注意。

```shell { linenos=table, linenostart=1 }
surface_aggregator
surface_aggregator_registry
surface_hid_core
surface_hid
intel_lpss
intel_lpss_pci
8250_dw
```

その後、以下を実行する。こちらも `sudo` が必要。

```shell { linenos=table, linenostart=1 }
update-initramfs -u
```


## おわり {#おわり}

あとは再起動すれば、SurfaceのロゴとともにLUKSのパスワードを聞かれるので、Surface備え付けのキーボードで
パスワードを打てることがわかる。


## 参考 {#surface-linux-reference}

-   <https://zenn.dev/sprout2000/articles/52caaffa9ad3fa>
-   <https://github.com/linux-surface/linux-surface>
